# DimensionUnlocked Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..DimensionUnlocked Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Dimension had to be un-EQed in order to remove sketch over-constraining.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DimensionUnlocked { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimensionUnlocked As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DimensionUnlocked {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace